*** Code

#+header: :var input_data=input_data
#+begin_src python :results verbatim replace output :exports both
treemap = input_data.splitlines()
dx = 3
dy = 1
x = 0
y = 0
count = 0

while y < len(treemap):
    if treemap[y][x % len(treemap[0])] == '#':
        count += 1
    x = x + dx
    y = y + dy
print(count)
#+end_src

#+RESULTS:
: 145

*** Code

#+header: :var input_data=input_data
#+begin_src python :results replace output :exports both
treemap = input_data.splitlines()

def traverse(dx, dy):
  x, y, count = 0, 0, 0

  while y < len(treemap):
    if treemap[y][x % len(treemap[0])] == '#':
      count += 1
    x = x + dx
    y = y + dy
  return count

trees = 1
waypoints = [(1, 1), (3, 1), (5, 1), (7, 1), (1, 2)]
for points in waypoints:
  trees *= traverse(*points)
print(trees)
#+end_src

#+RESULTS:
: 3424528800

